backend/app/models/short_url.rb

SELECT `short_urls`.* FROM `short_urls` WHERE `short_urls`.`id` = 325978886267 LIMIT 1
---
  def self.find_by_short_code(short_code)
    # Decode the number from base62-encoded short code.
    # @return [Number] the base62-decoded number.
    return nil if short_code.nil?
    record = ShortUrl.find_by(
				id: base62_decode(short_code)
		)