backend/app/jobs/update_title_job.rb

SELECT `short_urls`.* FROM `short_urls` WHERE `short_urls`.`id` = 74 LIMIT 1
UPDATE `short_urls` SET `short_urls`.`title` = 'Garima Chopra (@garima_chopra.23) • Instagram photos and videos', `short_urls`.`updated_at` = '2024-08-10 22:29:03.621104' WHERE `short_urls`.`id` = 1
---
  def perform(short_url_id)
    # Perform the job to update the title of a ShortUrl record.
    # @param [Integer] short_url_id The ID of the ShortUrl record to update.

    record = ShortUrl.find_by(id: short_url_id)
    return p "Record not found: #{short_url_id}" unless record

    begin
      promise = Concurrent::Promise.execute {
        URI.open(record.full_url) { |file|
			Nokogiri::HTML(file).at_css('title')&.text
		}
      }

      promise.then do |html_title|
        html_title ?
		record.update(title: html_title) && p("title found #{html_title}"):