backend/app/controllers/short_urls_controller.rb

INSERT INTO `short_urls` (`full_url`, `title`, `click_count`, `created_at`, `updated_at`) VALUES ('https://www.vishnushon.com', NULL, 0, '2024-08-10 04:19:41.553526', '2024-08-10 04:19:41.553526')
---
	def create
		# POST /short_urls
		# @param [String] full_url The full URL to be shortened.
		# @return [String] Returns a plain text "OK" if the URL is successfully created.
		begin
			req_full_url = strong_params(:full_url)
			url = URI.parse(req_full_url.gsub('\\', ''))

			url_shortner = ShortUrl.new(full_url: url.to_s)

			if url_shortner.save

SELECT `short_urls`.* FROM `short_urls` WHERE `short_urls`.`id` = 54 LIMIT 1
UPDATE `short_urls` SET `short_urls`.`full_url` = 'https://www.linkedin.com/in/raghavrmadya/', `short_urls`.`updated_at` = '2024-08-10 04:28:25.520582' WHERE `short_urls`.`id` = 54
UPDATE `short_urls` SET `short_urls`.`full_url` = 'https://roadmap.sh/react', `short_urls`.`updated_at` = '2024-08-09 19:20:06.888220' WHERE `short_urls`.`id` = 73
---
	def update
		# PATCH /short_urls
		# @param [String] full_url The current full URL to be updated.
		# @param [String] new_url The new URL to replace the existing one.
		# @return [JSON] Returns the updated URL record in JSON format.

		begin
			req_id = strong_params(:id)
			record = ShortUrl.find_by(
				id: req_id
			)

			req_new_url = strong_params(:new_url)
			url = URI.parse(req_new_url.gsub('\\', ''))

			if record.nil?
				render json: {
				  error: "Record Not Found",
				  reason: "The URL you are trying to update does not exist."
				}, status: NOT_FOUND and return
			end


			if record.update( full_url: url.to_s)
				record.update_title!

SELECT `short_urls`.* FROM `short_urls` WHERE `short_urls`.`id` = 54 LIMIT 1
DELETE FROM `short_urls` WHERE `short_urls`.`id` = 2
---
	def destroy
		# DELETE /short_urls
		# @param [String] full_url The full URL to be deleted.
		# @return [String] Returns a plain text "Deleted" if the URL is successfully destroyed.

		begin
			req_id = strong_params(:id)
			record = ShortUrl.find_by(
				id: req_id
			)

			if record.nil?
				render json: {
					error: "Record Not Found",
					reason: "The URL you are trying to update does not exist."
				}, status: NOT_FOUND and return
			end


			if record.destroy